In [1]:
import pandas as pd

In [3]:
df=pd.DataFrame({
    'a':[1,2,3,4,5],
    'b':[11,12,13,14,15],
    'c':[21,22,23,24,25],
    'd':[31,32,33,34,35]
},index=pd.MultiIndex.from_tuples([(1,2),(3,4),(5,6),(7,8),(9,10)],name=["first index","second index"]))
df

                          a   b   c   d
first index second index
1           2             1  11  21  31
3           4             2  12  22  32
5           6             3  13  23  33
7           8             4  14  24  34
9           10            5  15  25  35

In [6]:
df['a'].value_counts()

1    1
2    1
3    1
4    1
5    1
Name: a, dtype: int64

In [7]:
len(df)

5

In [9]:
df.shape

(5, 4)

In [23]:
df['a'].nunique()

5

In [24]:
df.describe()

              a          b          c          d
count  5.000000   5.000000   5.000000   5.000000
mean   3.000000  13.000000  23.000000  33.000000
std    1.581139   1.581139   1.581139   1.581139
min    1.000000  11.000000  21.000000  31.000000
25%    2.000000  12.000000  22.000000  32.000000
50%    3.000000  13.000000  23.000000  33.000000
75%    4.000000  14.000000  24.000000  34.000000
max    5.000000  15.000000  25.000000  35.000000

In [25]:
df['a'].sum()

15

In [28]:
df.sum()

a     15
b     65
c    115
d    165
dtype: int64

In [29]:
df.count()

a    5
b    5
c    5
d    5
dtype: int64

In [31]:
print(df.median())
print(df.mean())
print(df.var())

a     3.0
b    13.0
c    23.0
d    33.0
dtype: float64
a     3.0
b    13.0
c    23.0
d    33.0
dtype: float64
a    2.5
b    2.5
c    2.5
d    2.5
dtype: float64

In [34]:
def run(x):
    print(x**x)
df["a"].apply(run)

1
4
27
256
3125

first index  second index
1            2               None
3            4               None
5            6               None
7            8               None
9            10              None
Name: a, dtype: object

In [35]:
print(df.max())

a     5
b    15
c    25
d    35
dtype: int64

In [37]:
print(df.min())

a     1
b    11
c    21
d    31
dtype: int64

In [41]:
df1=pd.DataFrame({
    "a":[None,'1','2']
})

df1.dropna()

   a
1  1
2  2

In [43]:
df1.fillna("5")

   a
0  5
1  1
2  2

In [44]:
df1

      a
0  None
1     1
2     2